<template>
  <div class="privacy-page">
    <div class="pc-nav-bg"></div>
  <main>
    <div class="container">
      <h3>服务条款/免责声明</h3>
      <p>特别提示：在使用[myShape]的任何训练课程前，请先咨询健康专家您的身体状况是否适合参加此种训练以及该训练课程是否能够满足您的个人需求，因参加任何训练课程而引起的一切风险、损害及责任等，由您自行承担。</p>
      <p>上海形趣信息科技有限公司（含其关联公司，以下称"形趣"或"我们"）为[myShape]（以下称"myShape"或本产品）的实际开发者和运营者。myShape是通过专业多媒体课程和3D机器视觉识别反馈技术，提供全新的科技健身方式，包含硬件设备、移动端H5站点、小程序或APP。除提供视频课程外，myShape还包括部分社交分享及电商功能。本服务条款构成我们与myShape用户（以下称"用户"或"您"）之间就myShape提供的上述服务等事宜订立的契约，请仔细阅读本服务条款。</p>
      <p>您扫描myShape产品二维码成为myShape用户后，则即表示您同意接受本服务条款的约束，而本服务条款即构成对双方具有约束力的法律文件。</p>
      <h4>1. 服务条款的确认及接受</h4>
      <p>1.1 本产品的各项电子服务的所有权和运作权归形趣所有。您同意服务条款及隐私条款并使用本产品，即成为myShape的正式用户。用户确认：本服务条款是处理双方权利义务的契约，始终有效，法律另有强制性规定或双方另有特别约定的，依其规定。</p>
      <p>1.2 您点击同意本服务条款，即视为您确认自己已具有与享受本产品提供的课程训练、下单购物等服务相对应的权利能力和行为能力，并能够独立承担法律责任。</p>
      <p>1.3 如果您未满18周岁，您只能在父母或监护人的监护参与下才能使用本产品的课程服务或下单购物等。</p>
      <p>1.4 形趣保留在中华人民共和国大陆地区法现行法律法规允许的范围内自行决定拒绝服务、关闭用户账户、清除或编辑内容或取消订单等的权利。</p>
      <p>1.5 本产品的软件著作权及产品上发布的所有信息与内容的版权均受中华人民共国著作权法（含相关法律、法规）乃至世界版权法律的保护，仅供用户因自身学习、调研等目的免费使用。严禁未经授权对本产品内容进行复制、发行、出租、展览、放映、广播、修改、演绎、翻译、汇编、改编或逆向工程。上海形趣信息科技有限公司保留所有未在本服务条款中明确授予的权利。</p>
      <p>1.6 形趣通过互联网依法为用户提供互联网信息等服务，您在完全同意本服务条款及本产品其他规定（包括但不限于隐私条款、训练提示、退换货政策等在本产品发布的所有规则及政策）的情况下，方有权使用本产品的相关服务。</p>
      <p>1.7 用户必须自行准备如下设备并承担如下开支：（1）显示设备，本产品可能不包含显示设备，您在购买个人设备时需自行准备如电视、显示器等设备；（2）上网设备，包括并不限于手机或者其他上网终端、调制解调器及其他必备的上网装置；（3）上网开支，包括并不限于网络接入费、上网设备租用费、手机流量费等。</p>
      <h4>2. myShape账号注册规则</h4>
      <p>2.1 myShape账号注册资料包括但不限于用户的账号名称、头像、密码、注册或更新账号时输入的所有信息以及您在myShape商城进行购物时所填写的所有信息（包括但不限于收货人姓名、地址、联系电话等）。</p>
      <p>2.2 在注册myShape账号时，用户应承诺遵守法律法规、社会主义制度、国家利益、公民合法权益、公共秩序、社会道德风尚和信息真实性等七条底线，且保证在注册及使用myShape账号时，不得有以下情形：</p>
      <p>（1）违反宪法或法律法规规定的；</p>
      <p>（2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</p>
      <p>（3）损害国家荣誉和利益的，损害公共利益的；</p>
      <p>（4）煽动民族仇恨、民族歧视，破坏民族团结的；</p>
      <p>（5）破坏国家宗教政策，宣扬邪教和封建迷信的；</p>
      <p>（6）散布谣言，扰乱社会秩序，破坏社会稳定的；</p>
      <p>（7）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</p>
      <p>（8）侮辱或者诽谤他人，侵害他人合法权益的；</p>
      <p>（9）含有法律、行政法规禁止的其他内容或违反myShape的其他规定的。</p>
      <p> 2.3 用户应保证其提供的注册资料真实、准确、完整、合法有效，用户注册资料如有变动的，应及时更新。因用户提供的注册资料不符合本条款约定而引起的一切责任及后果（包括但不限于不予注册、账户停用或注销等），由用户自行承担，且形趣保留终止用户使用myShape各项服务的权利。</p>
      <p>2.4 用户以虚假信息骗取账号名称注册，或其账号头像、简介等注册信息存在违法和不良信息的，形趣有权采取通知限期改正、暂停使用、注销登记等措施。</p>
      <p>2.5 对冒用、关联机构或社会名人注册账号名称的用户，形趣有权注销其账号，并向互联网信息内容主管部门报告。</p>
      <p>2.6 用户在使用本产品服务或下单购物等活动时，涉及用户真实姓名/名称、通信地址、联系电话、电子邮箱等隐私信息的，本产品将予以严格保密，除非得到用户的授权或法律另有规定，本产品不会向外界披露。</p>
      <p>2.7 用户成功注册后，将产生用户名和密码等账户信息，您可以根据本产品规定更改您的密码。用户应谨慎合理的保存、使用其用户名和密码。用户若发现任何非法使用用户账号或存在安全漏洞的情况，请立即通知本产品并向公安机关报案。因用户未妥善保管其账户名称及密码而导致第三人使用账户而给用户造成的损失，由用户自行承担。</p>
      <p>2.8 您的myShape账户仅限于您自己使用，严禁将您的myShape账户允许第三人使用，否则用户应承担由此产生的全部责任，并与实际使用人承担连带责任。</p>
      <p>2.9 依据相关法律法规的规定，形趣有权对注册用户进行基于移动电话号码、电子邮箱、微信等真实身份信息认证。对于拒绝进行真实身份信息认证的用户，形趣保留拒绝此用户使用myShape相关服务的权利并有权对用户进行包括但不限于限制服务使用、关闭账号等的处理。</p>
      <h4>3.用户管理</h4>
      <p>3.1 用户必须遵守中华人民共和国及国际相关法律法规的规定，独立对其发布的内容（包括但不限于文字、图片等）承担责任。用户承诺：</p>
      <p>（1）用户在使用我们提供的服务或在本产品发布信息时必须符合中华人民共和国相关法律法规的规定，不得在本产品制作、复制、发布、传播以下内容或信息：</p>
      <p>(a) 违反宪法确定的基本原则的；</p>
      <p>(b) 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</p>
      <p>(c) 损害国家荣誉和利益的；</p>
      <p>(d) 煽动民族仇恨、民族歧视，破坏民族团结的；</p>
      <p>(e) 破坏国家宗教政策，宣扬邪教和封建迷信的；</p>
      <p>(f) 散布谣言，扰乱社会秩序，破坏社会稳定的；</p>
      <p>(g) 散布淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的；</p>
      <p>(h) 侮辱或者诽谤他人，侵害他人合法权益的；</p>
      <p>(i) 煽动非法集会、结社、游行、示威、聚众扰乱社会秩序的；</p>
      <p>(j) 以非法民间组织名义活动的；</p>
      <p>(k) 含有法律、行政法规禁止的其他内容或违反myShape的其他规定的。</p>
      <p>（2）用户在使用我们提供的服务或在本产品发布信息时还必须符合其他有关国家和地区的法律规定以及国际法的有关规定。</p>
      <p>3.2 用户理解并同意，其在本产品发布的任何信息（包括但不限于文字、图片等），均已自动授权形趣或myShape在包含宣传推广在内的各个合法途径使用。若用户对形趣或myShape使用信息的方式存在异议，应在发现后及时联系形趣或myShape进行沟通解决，若用户未对形趣或myShape的使用行为提出异议，则默认其同意此种使用行为且无权就上述使用主张权利。</p>

      <p>3.3 用户不得以任何方式干扰myShape服务且不得通过本产品发布任何形式的广告，myShape对用户发布的广告内容有权进行包括但不限于删除内容直至关闭账号的处理。因网络信息传播在时间上的即时性及空间上的广泛性，我们不可能在第一时间对用户发布广告的行为进行处理，在此提请用户需对此种广告的内容自行甄别，因用户受此种广告内容的影响而产生的任何损失，均与形趣或myShape无关。myShape鼓励用户对上述广告发布行为进行举报，我们会在收到举报后及时处理。</p>

      <p>3.4 责任承担</p>

      <p>（1）用户须对自己在使用myShape服务过程中的行为承担法律责任。用户承担法律责任的形式包括但不限于：对受到侵害者进行赔偿，以及在形趣公司首先承担了因用户行为导致的行政处罚或侵权损害赔偿责任后，用户应给予形趣公司等额的赔偿。若用户违反以上规定，我们有权作出独立判断立即暂停或终止对用户提供部分或全部服务，包括锁定、注销、删除用户myShape账号等措施。</p>

      <p>（2）用户理解，如果myShape发现其发布的信息明显属于本条第（1）款所列内容之一，依据中华人民共和国现行相关法律，本产品有义务立即停止传输，保存有关记录，向国家有关机关报告，并且删除含有该内容的地址、目录或关闭服务器。</p>

      <h4>4.用户隐私制度</h4>
      <p>4.1 用户知悉并同意，为了记录用户训练的真实数据以及在电商功能下给用户提供配送等相关服务，我们在您自愿的前提下收集您的个人信息并将这些信息进行整合，包括但不限于注册账号时的相关信息、个人身体数据（身高、体重、心率、健康数据等）、GPS定位数据、收货人的姓名、地址、电话等。</p>

      <p>4.2 尊重用户个人隐私是myShape的一项基本政策。所以，myShape不会公开或向任何第三方透露用户的注册资料以及用户因享受myShape服务而提供的任何信息，但以下情形除外：</p>

      <p>（1）事先获得用户的明确授权或许可；</p>

      <p>（2）遵守有关法律规定，包括在国家有关机关查询时，提供用户的注册信息、用户在本产品发布的信息内容及其发布时间、互联网地址或者域名等；</p>

      <p>（3）在紧急情况下竭力维护用户个人和社会大众的隐私安全；</p>

      <p>（4）根据本条款相关规定或者myShape认为必要的其他情形。</p>

      <p>myShape可能会与第三方合作向用户提供相关的网络服务，在此情况下，如该第三方同意承担与myShape同等的保护用户隐私的责任，则myShape可将用户信息提供给该第三方。</p>

      <h4>5.电商服务</h4>
      <p>为满足用户对健身周边产品的需求，本产品特向用户提供电商服务。myShape销售的产品以自营为主，亦有部分合作品牌产品的代销。在售产品信息可至myShape App内的商城进行浏览、查询及购买。</p>

      <p>5.1 商品信息</p>

      <p>商品价格、数量、性能介绍、是否有货等商品信息随时都有可能发生变动，myShape不作特别通知，请用户至商品销售页面自行查看。我们会尽最大努力保证您所浏览的商品信息的准确性，但由于商品种类繁多且商品信息的数量较大，加之互联网技术因素等客观原因存在，本产品显示的信息可能会有一定的滞后性或差错，对此情形请您知悉并理解。myShape欢迎纠错，并会视情况给予纠错者一定的奖励。</p>

      <p>5.2 订单</p>

      <p>5.2.1 在您下订单时，请仔细确认所购商品的名称、价格、数量、型号、规格、尺寸、收货人、电话、收货地址等信息。收货人与您本人不一致的，收货人的行为和意思表示视为您的行为和意思表示，您应对收货人的行为及意思表示的法律后果承担连带责任。您提交订单即表示对订单中所确认的订购商品、收货地址等信息的准确性负责。如果因为您填写的收货人联系电话、地址等信息错误，导致我们（或我们委托的配送公司）将货物交付给非您本意的收货人的，由此造成的损失需由您自行承担。</p>

      <p>5.2.2 如果您通过myShape订购商品，myShape商城展示的商品和价格等信息仅仅作为要约邀请，您的订单将成为订购商品的要约。收到您的订单后，我们会及时为您发货，只有当我们向您发出发货确认的电子邮件或短信，通知您我们已将您订购的商品发出时，才构成我们对您的订单的接受，您与我们之间的订购合同才成立。如果您在一份订单里订购了多种商品，而我们只向您发出了其中部分商品的发货确认电子邮件或短信，那么我们和您之间的订购合同仅就该部分商品成立。</p>

      <p>5.2.3 用户同意，形趣拥有通过邮件、短信电话等形式，向在本产品注册、购物用户、收货人发送订单信息、促销活动等告知信息的权利。</p>

      <p>5.2.4 由于市场变化及各种以合理商业努力难以控制的因素的影响，我们无法保证您提交的订单信息中希望购买的商品都会有货；如您拟购买的商品，在任何购买环节发生缺货或无货，您有权取消订单。</p>

      <p>5.2.5 为回馈用户的支持，我们会不定期向用户发放一些优惠券或代金券，上述优惠券或代金券的发放数量及规则由myShape自行决定，且由myShape享有解释权和修改权。您有权按照优惠券或代金券的使用规则在本产品购物时的使用，严禁转卖myShape优惠券或代金券或利用myShape账户进行其他经营性行为等。</p>

      <p>5.2.6 关于支付形式、商品退换货、售后服务等相关问题，请在商品销售页面或至帮助中心查看。</p>

      <p>5.3 配送</p>

      <p>5.3.1 我们将会把商品（货物）送到您指定的收货地址，所有在本产品上列出的以及客服告知的送达时间为参考时间，参考时间的计算是在综合考量库存状况、正常的处理过程和送货时间、送货地点的基础上估算得出的。参考时间可能与实际送达的时间有所出入，请您知悉并理解。</p>

      <p>5.3.2 因如下情形造成订单延迟或无法配送等，myShape不承担延迟配送的责任：</p>

      <p>（1）因用户提供的信息错误、地址不详细等原因导致的；</p>

      <p>（2）货物送达后无人签收，导致无法配送或延迟配送的；</p>

      <p>（3）情势变更因素导致的；</p>

      <p>（4）不可抗力因素导致的，例如：自然灾害、交通戒严、突发战争等。</p>
      <h4>6.所有权及知识产权条款</h4>
      <p>6.1 用户一旦接受本服务条款，即表明该用户主动将其在本产品发表的任何形式的信息内容（包括但不限于用户评论、用户咨询、各类话题文章、训练图片等）的财产性权利等任何可转让的权利，如著作权财产权（包括并不限于：复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权以及应当由著作权人享有的其他可转让权利）等，全部独家且不可撤销地转让给形趣所有，用户同意形趣有权就任何主体侵权而单独提起诉讼。</p>

      <p>6.2 本服务条款已经构成《中华人民共和国著作权法》第二十五条及相关法律规定的著作财产权等权利转让的书面协议，其效力及于用户在本产品发布的任何受著作权法保护的作品内容，无论该等内容形成于本服务条款订立前还是订立后。</p>

      <p>6.3 用户同意并已充分了解本条款的含义，承诺不将已发表于本产品的信息，以任何形式发布或授权其它主体以任何方式使用（包括但不限于在各类网站、媒体上使用）。</p>

      <p>6.4 形趣（含其关联企业）是myShape的所有者及运营者，拥有myShape App内容、资源及软件的著作权等合法权利，受国家法律保护，有权不时地对本服务条款、myShape App版本及内容进行修改或更新，并在App内张贴或直接更新，无须另行通知用户。在法律允许的最大限度范围内，形趣（含其关联企业）对本条款及myShape App内容拥有解释权。</p>

      <p>6.5 除法律另有强制性规定外，未经形趣（含其关联企业）明确的特别书面许可，任何单位或个人不得以任何方式非法地全部或部分复制、转载、引用、链接、抓取或以其他方式使用本产品及myShape App内的信息内容，否则，形趣有权追究其法律责任。</p>

      <p>6.6 本产品及myShape App内所刊登的资料信息（诸如文字、图表、标识、按钮图标、图像、声音文件片段、 数字下载、数据编辑和软件），均是形趣或其内容提供者的财产，受中华人民共和国和国际版权法及相关法律法规的保护；上述内容的汇编是形趣的排他财产，受中华人民共和国和国际版权法及相关法律法规的保护；本产品上所有软件都是形趣（含其关联公司）的财产，受中华人民共和国和国际版权法及相关法律法规的保护。</p>

      <h4>7.责任限制及不承诺担保</h4>
      <p>7.1 除非另有明确的书面说明，本产品及其所包含的或以其它方式通过本产品提供给您的全部信息、内容、材料、产品（包括软硬件）和服务，均是在"按现状"和"按现有"的基础上提供的。</p>

      <p>7.2 除非另有明确的书面说明，我们不对本产品的运营及其包含在本产品上的信息、内容、材料、产品（包括软硬件）或服务作任何形式的、明示或默示的声明或担保（根据中华人民共和国法律另有规定的以外）。</p>

      <p>7.3 我们不担保本产品所包含的或以其它方式通过本产品提供给您的全部信息、内容、材料、产品（包括软硬件）和服务、其服务器或从本产品发出的电子信件、信息没有病毒或其他有害成分。</p>

      <p>7.4 如因不可抗力或其它本产品无法控制的原因使本产品服务系统崩溃或无法正常使用导致服务不可用或网上交易无法完成或丢失有关的信息、记录等，我们会合理地尽力协助处理善后事宜。</p>

      <h4>8.协议更新及用户关注义务</h4>
      <p>根据国家法律法规的更新及网站运营需要，我们有权对本条款不时地进行修改，修改后的服务条款一旦被张贴在本产品上即生效力，并代替原来的服务条款。用户可随时登录查阅最新服务条款内容。如用户不同意更新后的服务条款，应立即停止接受本产品提供的服务；如用户继续使用本产品提供的服务，即视为同意更新后的服务条款。我们建议您在使用本产品之前阅读本服务条款及本产品的公告。如果本服务条款中任何一条被视为废止、无效或因任何理由不可执行，该条应视为可分的且并不影响任何其余条款的有效性和可执行性。</p>

      <h4>9.法律管辖和适用</h4>
      <p>本服务条款的订立、执行和解释及争议的解决均应适用在中华人民共和国大陆地区现行之有效法律。 如发生本服务条款的某些内容与适用之法律相抵触时，则这些条款将完全按法律规定重新解释，而其它有效条款继续有效。如缔约方就本条款内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，任何一方均可向有管辖权的中华人民共和国大陆地区法院提起诉讼。</p>

      <h4>10.其他</h4>
      <p>10.1 myShape的所有者是指在政府部门依法许可或备案的myShape的经营主体。</p>

      <p>10.2 我们尊重用户和消费者的合法权利，本服务条款及本产品上发布的各类规则、政策、声明等其他内容，均是为了更好的、更加便利的为用户和消费者提供服务。myShape欢迎用户和社会各界提出意见和建议，您可以通过以下电子邮箱联系我们：contact@myShape.com，我们将虚心接受并适时修改本服务条款及相关政策、规则。</p>

      <p>10.3 您注册或使用myShape产品则意味着您完全接受本服务条款，在注册或使用产品之前请您再次确认已知悉并完全理解本服务条款的全部内容。</p>

    </div>
  </main>
  </div>
</template>

<script lang="ts">
import { Component, Vue } from "vue-property-decorator";

@Component({})
export default class Disclaimer extends Vue {}
</script>

<style lang="scss" scoped src='../assets/style/privacy-clause.scss'></style>

